MikroElektronika/core_packages/ARM/gcc_clang/def/ti/MSPM0C1106-Q1/mcu.h
/*****************************************************************************

  Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com/ 

  Redistribution and use in source and binary forms, with or without 
  modification, are permitted provided that the following conditions 
  are met:

   Redistributions of source code must retain the above copyright 
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the 
   documentation and/or other materials provided with the   
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifndef ti_devices_msp_m0p_mspm0c1105_C1106__include
#define ti_devices_msp_m0p_mspm0c1105_C1106__include

/* Filename: mspm0c1105_c1106.h */
/* Revised: 2024-06-21 09:34:50*/

/* Use standard integer types with explicit width */
#include <stdint.h>
#include <stdbool.h>

#ifdef __cplusplus
 extern "C" {
#endif

/** @addtogroup MSPM0C1105_C1106_Definitions MSPM0C1105_C1106 Definitions
  This file defines all structures and symbols for MSPM0C1105_C1106
  @{
*/

/** @addtogroup MSPM0C1105_C1106_CMSIS Device CMSIS Definitions
  Configuration of the Processor and Core Peripherals
  @{
*/
/******************************************************************************
* Interrupt Definitions                                                       *
******************************************************************************/
typedef enum IRQn
{
  NonMaskableInt_IRQn         = -14,    /* 2  Non Maskable Interrupt */
  HardFault_IRQn              = -13,    /* 3  Hard Fault Interrupt */
  SVCall_IRQn                 = -5,     /* 11 SV Call Interrupt */
  PendSV_IRQn                 = -2,     /* 14 Pend SV Interrupt */
  SysTick_IRQn                = -1,     /* 15 System Tick Interrupt */
  SYSCTL_INT_IRQn             = 0,      /* 16 SYSCTL_INT Interrupt */
  DEBUGSS_INT_IRQn            = 1,      /* 17 DEBUGSS_INT Interrupt */
  TIMG8_INT_IRQn              = 2,      /* 18 TIMG8_INT Interrupt */
  UART1_INT_IRQn              = 3,      /* 19 UART1_INT Interrupt */
  ADC0_INT_IRQn               = 4,      /* 20 ADC0_INT Interrupt */
  COMP0_INT_IRQn              = 7,      /* 23 COMP0_INT Interrupt */
  UART2_INT_IRQn              = 8,      /* 24 UART2_INT Interrupt */
  SPI0_INT_IRQn               = 9,      /* 25 SPI0_INT Interrupt */
  UART0_INT_IRQn              = 15,     /* 31 UART0_INT Interrupt */
  TIMG14_INT_IRQn             = 16,     /* 32 TIMG14_INT Interrupt */
  TIMG2_INT_IRQn              = 17,     /* 33 TIMG2_INT Interrupt */
  TIMA0_INT_IRQn              = 18,     /* 34 TIMA0_INT Interrupt */
  TIMG1_INT_IRQn              = 19,     /* 35 TIMG1_INT Interrupt */
  GPIOA_INT_IRQn              = 22,     /* 38 GPIOA_INT Interrupt */
  GPIOB_INT_IRQn              = 23,     /* 39 GPIOB_INT Interrupt */
  I2C0_INT_IRQn               = 24,     /* 40 I2C0_INT Interrupt */
  I2C1_INT_IRQn               = 25,     /* 41 I2C1_INT Interrupt */
  FLASHCTL_INT_IRQn           = 27,     /* 43 FLASHCTL_INT Interrupt */
  WWDT0_INT_IRQn              = 29,     /* 45 WWDT0_INT Interrupt */
  LFSS_INT_IRQn               = 30,     /* 46 LFSS_INT Interrupt */
  RTC_B_INT_IRQn              = 30,     /* 46 RTC_B_INT Interrupt */
  DMA_INT_IRQn                = 31,     /* 47 DMA_INT Interrupt */
} IRQn_Type;

#define NonMaskableInt_VECn     2     /* Non Maskable Interrupt */
#define HardFault_VECn          3     /* Hard Fault Interrupt */
#define SVCall_VECn             11    /* SV Call Interrupt */
#define PendSV_VECn             14    /* Pend SV Interrupt */
#define SysTick_VECn            15    /* System Tick Interrupt */
#define SYSCTL_INT_VECn         16    /* SYSCTL_INT Interrupt */
#define DEBUGSS_INT_VECn        17    /* DEBUGSS_INT Interrupt */
#define TIMG8_INT_VECn          18    /* TIMG8_INT Interrupt */
#define UART1_INT_VECn          19    /* UART1_INT Interrupt */
#define ADC0_INT_VECn           20    /* ADC0_INT Interrupt */
#define COMP0_INT_VECn          23    /* COMP0_INT Interrupt */
#define UART2_INT_VECn          24    /* UART2_INT Interrupt */
#define SPI0_INT_VECn           25    /* SPI0_INT Interrupt */
#define UART0_INT_VECn          31    /* UART0_INT Interrupt */
#define TIMG14_INT_VECn         32    /* TIMG14_INT Interrupt */
#define TIMG2_INT_VECn          33    /* TIMG2_INT Interrupt */
#define TIMA0_INT_VECn          34    /* TIMA0_INT Interrupt */
#define TIMG1_INT_VECn          35    /* TIMG1_INT Interrupt */
#define GPIOA_INT_VECn          38    /* GPIOA_INT Interrupt */
#define GPIOB_INT_VECn          39    /* GPIOB_INT Interrupt */
#define I2C0_INT_VECn           40    /* I2C0_INT Interrupt */
#define I2C1_INT_VECn           41    /* I2C1_INT Interrupt */
#define FLASHCTL_INT_VECn       43    /* FLASHCTL_INT Interrupt */
#define WWDT0_INT_VECn          45    /* WWDT0_INT Interrupt */
#define LFSS_INT_VECn           46    /* LFSS_INT Interrupt */
#define RTC_B_INT_VECn          46    /* RTC_B_INT Interrupt */
#define DMA_INT_VECn            47    /* DMA_INT Interrupt */


