MikroElektronika/core_packages/ARM/gcc_clang/def/ti/MSPM0C1106-Q1/mcu.h
/******************************************************************************
* Peripheral declarations                                                     *
******************************************************************************/
/** @addtogroup MSPM0C1105_C1106_PeripheralDecl MSPM0C1105_C1106 Peripheral Declaration
  @{
*/

static UART_Regs                                * const UART1                          = ((UART_Regs *) UART1_BASE);
static SPI_Regs                                 * const SPI0                           = ((SPI_Regs *) SPI0_BASE);
static CRC_Regs                                 * const CRC                            = ((CRC_Regs *) CRC_BASE);
static GPTIMER_Regs                             * const TIMA0                          = ((GPTIMER_Regs *) TIMA0_BASE);
static GPIO_Regs                                * const GPIOB                          = ((GPIO_Regs *) GPIOB_BASE);
static UART_Regs                                * const UART2                          = ((UART_Regs *) UART2_BASE);
static GPTIMER_Regs                             * const TIMG1                          = ((GPTIMER_Regs *) TIMG1_BASE);
static GPTIMER_Regs                             * const TIMG8                          = ((GPTIMER_Regs *) TIMG8_BASE);
static WWDT_Regs                                * const WWDT0                          = ((WWDT_Regs *) WWDT0_BASE);
static UART_Regs                                * const UART0                          = ((UART_Regs *) UART0_BASE);
static I2C_Regs                                 * const I2C1                           = ((I2C_Regs *) I2C1_BASE);
static GPTIMER_Regs                             * const TIMG2                          = ((GPTIMER_Regs *) TIMG2_BASE);
static DEBUGSS_Regs                             * const DEBUGSS                        = ((DEBUGSS_Regs *) DEBUGSS_BASE);
static GPIO_Regs                                * const GPIOA                          = ((GPIO_Regs *) GPIOA_BASE);
static FLASHCTL_Regs                            * const FLASHCTL                       = ((FLASHCTL_Regs *) FLASHCTL_BASE);
static I2C_Regs                                 * const I2C0                           = ((I2C_Regs *) I2C0_BASE);
static WUC_Regs                                 * const WUC                            = ((WUC_Regs *) WUC_BASE);
static DMA_Regs                                 * const DMA                            = ((DMA_Regs *) DMA_BASE);
static COMP_Regs                                * const COMP0                          = ((COMP_Regs *) COMP0_BASE);
static CPUSS_Regs                               * const CPUSS                          = ((CPUSS_Regs *) CPUSS_BASE);
static SYSCTL_Regs                              * const SYSCTL                         = ((SYSCTL_Regs *) SYSCTL_BASE);
static IOMUX_Regs                               * const IOMUX                          = ((IOMUX_Regs *) IOMUX_BASE);
static GPTIMER_Regs                             * const TIMG14                         = ((GPTIMER_Regs *) TIMG14_BASE);
static LFSS_Regs                                * const LFSS                           = ((LFSS_Regs *) LFSS_BASE);
static RTC_Regs                                 * const RTC_B                          = ((RTC_Regs *) RTC_B_BASE);
static VREF_Regs                                * const VREF                           = ((VREF_Regs *) VREF_BASE);
static ADC12_Regs                               * const ADC0                           = ((ADC12_Regs *) ADC0_BASE);
static ADC12_PERIPHERALREGIONSVT_Regs           * const ADC0_PERIPHERALREGIONSVT       = ((ADC12_PERIPHERALREGIONSVT_Regs *) ADC0_PERIPHERALREGIONSVT_BASE);
static FACTORYREGION_OPEN_Regs                  * const FACTORYREGION                  = ((FACTORYREGION_OPEN_Regs *) FACTORYREGION_BASE);

/******************************************************************************
* SYS parameters                                                              *
******************************************************************************/

#define UART1_SYS_FENTRIES                            (4)       /* !< Number of FIFO entries */
#define SPI0_SYS_FENTRIES                             (4)       /* !< The number of entries in RX and TX FIFO */
#define CRC_SYS_CRC32_ENABLE                          (0)       /* !< Parameter to exclude or include 32-bit CRC. This is added for
                                                      Lego_N1 products where 32-bit CRC can be excluded in order to save
                                                      gates. */
#define UART2_SYS_FENTRIES                            (4)       /* !< Number of FIFO entries */
#define UART0_SYS_FENTRIES                            (4)       /* !< Number of FIFO entries */
#define I2C_SYS_FENTRIES                              (4)       /* !< Parameter for number of FIFO entries */
#define FLASHCTL_SYS_DATAWIDTH                        (64)      /* !< Data bit width of a single flash word:    Minimum: 64    Maximum:
                                                      128 */
#define FLASHCTL_SYS_WEPROTBWIDTH                     (8)       /* !< Bit width of WEPROTB register. */
#define FLASHCTL_SYS_WEPROTAWIDTH                     (0)       /* !< Bit width of WEPROTA register. */
#define FLASHCTL_SYS_WEPROTCWIDTH                     (0)       /* !< Bit width of WEPROTC register. */
#define DMA_SYS_N_DMA_CHANNEL                         (3)       /* !< Number of DMA channels implemented in DMA. */
#define DMA_SYS_N_DMA_FULL_CHANNEL                    (2)       /* !< Number of FULL-DMA channels implemented in DMA. If
                                                      SYS_N_DMA_CHANNEL is larger than SYS_N_DMA_FULL_CHANNEL, the
                                                      remaining channel will be BASIC channel with limited functionality. */
#define DMA_SYS_MMR_AUTO                              (1)       /* !< Boolean for if auto enable channels implemented in DMA. */
#define DMA_SYS_MMR_EM                                (1)       /* !< Boolean for if extended mode channels implemented in DMA. */
#define DMA_SYS_MMR_LLONG                             (1)       /* !< Boolean for if channels implemented in DMA with 128-bit access. */
#define DMA_SYS_MMR_STRIDE                            (1)       /* !< Boolean for if channels implemented in DMA with stride mode. */
#define ADC_SYS_NUM_ANALOG_CHAN                       (32)      /* !< Number of analog channels. */
#define COMP_SYS_DACOUT_EN                            (1)       /* !< Boolean for if 8-bit DAC output to pin is available */

