MikroElektronika/core_packages/ARM/gcc_clang/def/ti/MSPM0C1106-Q1/mcu.h
/* IOMUX_PINCM21[PF] Bits */
#define IOMUX_PINCM21_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM21_PF_GPIOB_DIO14                  ((uint32_t)0X00000001)
#define IOMUX_PINCM21_PF_TIMA0_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM21_PF_TIMG8_IDX                    ((uint32_t)0X00000006)
#define IOMUX_PINCM21_PF_SPI0_CS3_CD_POCI3            ((uint32_t)0X00000007)
#define IOMUX_PINCM21_PF_TIMG2_CCP1                   ((uint32_t)0X00000008)
#define IOMUX_PINCM21_PF_I2C0_SDA                     ((uint32_t)0X00000009)
#define IOMUX_PINCM21_PF_SPI0_PICO                    ((uint32_t)0X0000000A)
#define IOMUX_PINCM21_PF_UART0_TX                     ((uint32_t)0X0000000B)
#define IOMUX_PINCM21_PF_TIMA_FAULT2                  ((uint32_t)0X0000000C)
#define IOMUX_PINCM21_PF_TIMA_FAULT0                  ((uint32_t)0X0000000D)
#define IOMUX_PINCM21_PF_TIMG14_CCP2                  ((uint32_t)0X0000000E)

/* IOMUX_PINCM22[PF] Bits */
#define IOMUX_PINCM22_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM22_PF_GPIOB_DIO15                  ((uint32_t)0X00000001)
#define IOMUX_PINCM22_PF_UART2_TX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM22_PF_TIMG8_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM22_PF_TIMG2_CCP0                   ((uint32_t)0X00000006)
#define IOMUX_PINCM22_PF_TIMA0_CCP1_CMPL              ((uint32_t)0X0000000C)
#define IOMUX_PINCM22_PF_UART1_TX                     ((uint32_t)0X0000000D)
#define IOMUX_PINCM22_PF_TIMG2_CCP1                   ((uint32_t)0X0000000E)

/* IOMUX_PINCM23[PF] Bits */
#define IOMUX_PINCM23_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM23_PF_GPIOB_DIO16                  ((uint32_t)0X00000001)
#define IOMUX_PINCM23_PF_UART2_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM23_PF_TIMG8_CCP1                   ((uint32_t)0X00000005)
#define IOMUX_PINCM23_PF_TIMG2_CCP1                   ((uint32_t)0X00000006)
#define IOMUX_PINCM23_PF_TIMA0_CCP2_CMPL              ((uint32_t)0X0000000C)
#define IOMUX_PINCM23_PF_UART1_RX                     ((uint32_t)0X0000000D)
#define IOMUX_PINCM23_PF_I2C1_SDA                     ((uint32_t)0X0000000E)

/* IOMUX_PINCM24[PF] Bits */
#define IOMUX_PINCM24_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM24_PF_GPIOA_DIO12                  ((uint32_t)0X00000001)
#define IOMUX_PINCM24_PF_SPI0_SCLK                    ((uint32_t)0X00000002)
#define IOMUX_PINCM24_PF_TIMA0_CCP3                   ((uint32_t)0X00000004)
#define IOMUX_PINCM24_PF_SYSCTL_FCC_IN                ((uint32_t)0X00000005)
#define IOMUX_PINCM24_PF_TIMG14_CCP0                  ((uint32_t)0X00000006)
#define IOMUX_PINCM24_PF_SPI0_CS1_POCI1               ((uint32_t)0X00000008)
#define IOMUX_PINCM24_PF_UART2_CTS                    ((uint32_t)0X00000009)
#define IOMUX_PINCM24_PF_UART1_CTS                    ((uint32_t)0X0000000A)
#define IOMUX_PINCM24_PF_TIMA0_CCP3_CMPL              ((uint32_t)0X0000000B)
#define IOMUX_PINCM24_PF_I2C1_SCL                     ((uint32_t)0X0000000C)
#define IOMUX_PINCM24_PF_TIMG2_CCP1                   ((uint32_t)0X0000000D)
#define IOMUX_PINCM24_PF_COMP0_OUT                    ((uint32_t)0X0000000E)

/* IOMUX_PINCM25[PF] Bits */
#define IOMUX_PINCM25_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM25_PF_GPIOA_DIO13                  ((uint32_t)0X00000001)
#define IOMUX_PINCM25_PF_UART0_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM25_PF_SPI0_POCI                    ((uint32_t)0X00000003)
#define IOMUX_PINCM25_PF_TIMA0_CCP2_CMPL              ((uint32_t)0X00000004)
#define IOMUX_PINCM25_PF_TIMA0_CCP3_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM25_PF_LFSS_RTC_OUT                 ((uint32_t)0X00000006)
#define IOMUX_PINCM25_PF_TIMG14_CCP1                  ((uint32_t)0X00000007)
#define IOMUX_PINCM25_PF_TIMG14_CCP3                  ((uint32_t)0X00000008)
#define IOMUX_PINCM25_PF_SPI0_CS3_CD_POCI3            ((uint32_t)0X00000009)
#define IOMUX_PINCM25_PF_UART2_TX                     ((uint32_t)0X0000000A)
#define IOMUX_PINCM25_PF_UART1_RTS                    ((uint32_t)0X0000000B)
#define IOMUX_PINCM25_PF_SPI0_CS0                     ((uint32_t)0X0000000C)
#define IOMUX_PINCM25_PF_TIMG8_CCP1                   ((uint32_t)0X0000000D)
#define IOMUX_PINCM25_PF_TIMA0_CCP1                   ((uint32_t)0X0000000E)

/* IOMUX_PINCM26[PF] Bits */
#define IOMUX_PINCM26_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM26_PF_GPIOA_DIO14                  ((uint32_t)0X00000001)
#define IOMUX_PINCM26_PF_UART0_CTS                    ((uint32_t)0X00000002)
#define IOMUX_PINCM26_PF_SPI0_PICO                    ((uint32_t)0X00000003)
#define IOMUX_PINCM26_PF_TIMG1_CCP0                   ((uint32_t)0X00000004)
#define IOMUX_PINCM26_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000006)
#define IOMUX_PINCM26_PF_SPI0_CS2_POCI2               ((uint32_t)0X00000009)
#define IOMUX_PINCM26_PF_UART2_RX                     ((uint32_t)0X0000000A)
#define IOMUX_PINCM26_PF_I2C0_SCL                     ((uint32_t)0X0000000C)
#define IOMUX_PINCM26_PF_UART0_TX                     ((uint32_t)0X0000000D)
#define IOMUX_PINCM26_PF_TIMA0_CCP2                   ((uint32_t)0X0000000E)

/* IOMUX_PINCM27[PF] Bits */
#define IOMUX_PINCM27_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM27_PF_GPIOA_DIO15                  ((uint32_t)0X00000001)
#define IOMUX_PINCM27_PF_UART0_RTS                    ((uint32_t)0X00000002)
#define IOMUX_PINCM27_PF_SPI0_CS2_POCI2               ((uint32_t)0X00000003)
#define IOMUX_PINCM27_PF_I2C1_SCL                     ((uint32_t)0X00000004)
#define IOMUX_PINCM27_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM27_PF_TIMG8_IDX                    ((uint32_t)0X00000007)
#define IOMUX_PINCM27_PF_UART2_RTS                    ((uint32_t)0X0000000A)
#define IOMUX_PINCM27_PF_TIMG14_CCP1                  ((uint32_t)0X0000000C)

