MikroElektronika/core_packages/ARM/gcc_clang/def/ti/MSPM0C1106-Q1/mcu.h
/* IOMUX_PINCM28[PF] Bits */
#define IOMUX_PINCM28_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM28_PF_GPIOA_DIO16                  ((uint32_t)0X00000001)
#define IOMUX_PINCM28_PF_SPI0_POCI                    ((uint32_t)0X00000003)
#define IOMUX_PINCM28_PF_I2C1_SDA                     ((uint32_t)0X00000004)
#define IOMUX_PINCM28_PF_TIMA0_CCP2_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM28_PF_SYSCTL_FCC_IN                ((uint32_t)0X00000007)
#define IOMUX_PINCM28_PF_UART2_CTS                    ((uint32_t)0X0000000A)
#define IOMUX_PINCM28_PF_TIMG14_CCP2                  ((uint32_t)0X0000000C)
#define IOMUX_PINCM28_PF_COMP0_OUT                    ((uint32_t)0X0000000E)

/* IOMUX_PINCM29[PF] Bits */
#define IOMUX_PINCM29_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM29_PF_GPIOA_DIO17                  ((uint32_t)0X00000001)
#define IOMUX_PINCM29_PF_UART1_TX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM29_PF_TIMA0_CCP2                   ((uint32_t)0X00000003)
#define IOMUX_PINCM29_PF_I2C1_SCL                     ((uint32_t)0X00000004)
#define IOMUX_PINCM29_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM29_PF_TIMG2_CCP0                   ((uint32_t)0X00000006)
#define IOMUX_PINCM29_PF_TIMG8_CCP0                   ((uint32_t)0X00000007)
#define IOMUX_PINCM29_PF_TIMA0_CCP0_CMPL              ((uint32_t)0X00000008)
#define IOMUX_PINCM29_PF_SPI0_CS1_POCI1               ((uint32_t)0X00000009)
#define IOMUX_PINCM29_PF_SPI0_SCLK                    ((uint32_t)0X0000000A)
#define IOMUX_PINCM29_PF_I2C0_SDA                     ((uint32_t)0X0000000B)
#define IOMUX_PINCM29_PF_UART0_RX                     ((uint32_t)0X0000000C)

/* IOMUX_PINCM30[PF] Bits */
#define IOMUX_PINCM30_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM30_PF_GPIOA_DIO18                  ((uint32_t)0X00000001)
#define IOMUX_PINCM30_PF_UART1_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM30_PF_UART1_RTS                    ((uint32_t)0X00000003)
#define IOMUX_PINCM30_PF_I2C1_SDA                     ((uint32_t)0X00000004)
#define IOMUX_PINCM30_PF_TIMA0_CCP3_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM30_PF_TIMG2_CCP1                   ((uint32_t)0X00000006)
#define IOMUX_PINCM30_PF_TIMG8_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM30_PF_SPI0_PICO                    ((uint32_t)0X00000008)
#define IOMUX_PINCM30_PF_SPI0_CS0                     ((uint32_t)0X00000009)
#define IOMUX_PINCM30_PF_TIMA0_CCP1_CMPL              ((uint32_t)0X0000000A)
#define IOMUX_PINCM30_PF_TIMA0_CCP0                   ((uint32_t)0X0000000B)
#define IOMUX_PINCM30_PF_SPI0_POCI                    ((uint32_t)0X0000000C)
#define IOMUX_PINCM30_PF_TIMA_FAULT2                  ((uint32_t)0X0000000D)
#define IOMUX_PINCM30_PF_SYSCTL_CLK_OUT               ((uint32_t)0X0000000E)

/* IOMUX_PINCM31[PF] Bits */
#define IOMUX_PINCM31_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM31_PF_GPIOA_DIO29                  ((uint32_t)0X00000001)
#define IOMUX_PINCM31_PF_UART0_RTS                    ((uint32_t)0X00000002)
#define IOMUX_PINCM31_PF_SPI0_PICO                    ((uint32_t)0X00000003)

/* IOMUX_PINCM32[PF] Bits */
#define IOMUX_PINCM32_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM32_PF_GPIOA_DIO19                  ((uint32_t)0X00000001)
#define IOMUX_PINCM32_PF_DEBUGSS_SWDIO                ((uint32_t)0X00000002)
#define IOMUX_PINCM32_PF_SPI0_SCLK                    ((uint32_t)0X00000003)
#define IOMUX_PINCM32_PF_I2C1_SDA                     ((uint32_t)0X00000004)
#define IOMUX_PINCM32_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM32_PF_TIMG14_CCP0                  ((uint32_t)0X00000006)
#define IOMUX_PINCM32_PF_SPI0_POCI                    ((uint32_t)0X00000007)
#define IOMUX_PINCM32_PF_UART0_CTS                    ((uint32_t)0X00000008)
#define IOMUX_PINCM32_PF_UART1_RX                     ((uint32_t)0X0000000B)
#define IOMUX_PINCM32_PF_SPI0_PICO                    ((uint32_t)0X0000000D)

/* IOMUX_PINCM33[PF] Bits */
#define IOMUX_PINCM33_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM33_PF_GPIOA_DIO20                  ((uint32_t)0X00000001)
#define IOMUX_PINCM33_PF_DEBUGSS_SWCLK                ((uint32_t)0X00000002)
#define IOMUX_PINCM33_PF_TIMA_FAULT1                  ((uint32_t)0X00000003)
#define IOMUX_PINCM33_PF_I2C1_SCL                     ((uint32_t)0X00000004)
#define IOMUX_PINCM33_PF_TIMA0_CCP2_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM33_PF_TIMG14_CCP1                  ((uint32_t)0X00000006)
#define IOMUX_PINCM33_PF_SPI0_PICO                    ((uint32_t)0X00000007)
#define IOMUX_PINCM33_PF_TIMA0_CCP0                   ((uint32_t)0X00000008)
#define IOMUX_PINCM33_PF_UART0_RTS                    ((uint32_t)0X0000000A)
#define IOMUX_PINCM33_PF_UART1_TX                     ((uint32_t)0X0000000B)
#define IOMUX_PINCM33_PF_SPI0_CS0                     ((uint32_t)0X0000000C)
#define IOMUX_PINCM33_PF_UART1_RX                     ((uint32_t)0X0000000D)

/* IOMUX_PINCM34[PF] Bits */
#define IOMUX_PINCM34_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM34_PF_GPIOB_DIO17                  ((uint32_t)0X00000001)
#define IOMUX_PINCM34_PF_UART2_TX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM34_PF_SPI0_PICO                    ((uint32_t)0X00000003)
#define IOMUX_PINCM34_PF_I2C0_SCL                     ((uint32_t)0X00000004)
#define IOMUX_PINCM34_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM34_PF_TIMG14_CCP0                  ((uint32_t)0X00000006)
#define IOMUX_PINCM34_PF_TIMG1_CCP0                   ((uint32_t)0X00000009)
#define IOMUX_PINCM34_PF_SPI0_CS0                     ((uint32_t)0X0000000A)

/* IOMUX_PINCM35[PF] Bits */
#define IOMUX_PINCM35_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM35_PF_GPIOB_DIO18                  ((uint32_t)0X00000001)
#define IOMUX_PINCM35_PF_UART2_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM35_PF_SPI0_SCLK                    ((uint32_t)0X00000003)
#define IOMUX_PINCM35_PF_I2C0_SDA                     ((uint32_t)0X00000004)
#define IOMUX_PINCM35_PF_TIMA0_CCP2_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM35_PF_TIMG14_CCP1                  ((uint32_t)0X00000006)
#define IOMUX_PINCM35_PF_SPI0_CS0                     ((uint32_t)0X00000007)
#define IOMUX_PINCM35_PF_TIMG1_CCP1                   ((uint32_t)0X00000009)
#define IOMUX_PINCM35_PF_TIMA0_CCP1                   ((uint32_t)0X0000000C)
#define IOMUX_PINCM35_PF_UART0_RTS                    ((uint32_t)0X0000000D)

/* IOMUX_PINCM36[PF] Bits */
#define IOMUX_PINCM36_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM36_PF_GPIOB_DIO19                  ((uint32_t)0X00000001)
#define IOMUX_PINCM36_PF_SPI0_POCI                    ((uint32_t)0X00000003)
#define IOMUX_PINCM36_PF_TIMG8_CCP1                   ((uint32_t)0X00000004)
#define IOMUX_PINCM36_PF_UART0_CTS                    ((uint32_t)0X00000005)
#define IOMUX_PINCM36_PF_TIMG2_CCP1                   ((uint32_t)0X00000006)
#define IOMUX_PINCM36_PF_TIMG8_IDX                    ((uint32_t)0X00000007)
#define IOMUX_PINCM36_PF_UART2_CTS                    ((uint32_t)0X00000008)
#define IOMUX_PINCM36_PF_TIMA0_CCP1_CMPL              ((uint32_t)0X0000000C)
#define IOMUX_PINCM36_PF_UART2_RX                     ((uint32_t)0X0000000D)
#define IOMUX_PINCM36_PF_COMP0_OUT                    ((uint32_t)0X0000000E)

/* IOMUX_PINCM37[PF] Bits */
#define IOMUX_PINCM37_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM37_PF_GPIOA_DIO21                  ((uint32_t)0X00000001)
#define IOMUX_PINCM37_PF_UART2_TX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM37_PF_SPI0_CS3_CD_POCI3            ((uint32_t)0X00000003)
#define IOMUX_PINCM37_PF_UART1_CTS                    ((uint32_t)0X00000004)
#define IOMUX_PINCM37_PF_TIMA0_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM37_PF_TIMG1_CCP0                   ((uint32_t)0X00000006)
#define IOMUX_PINCM37_PF_UART2_CTS                    ((uint32_t)0X00000008)
#define IOMUX_PINCM37_PF_TIMG8_CCP0                   ((uint32_t)0X0000000A)
#define IOMUX_PINCM37_PF_TIMA0_CCP0_CMPL              ((uint32_t)0X0000000C)
#define IOMUX_PINCM37_PF_UART2_RX                     ((uint32_t)0X0000000D)

/* IOMUX_PINCM38[PF] Bits */
#define IOMUX_PINCM38_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM38_PF_GPIOA_DIO22                  ((uint32_t)0X00000001)
#define IOMUX_PINCM38_PF_UART2_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM38_PF_SPI0_CS2_POCI2               ((uint32_t)0X00000003)
#define IOMUX_PINCM38_PF_UART1_RTS                    ((uint32_t)0X00000004)
#define IOMUX_PINCM38_PF_TIMA0_CCP0_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM38_PF_TIMG1_CCP1                   ((uint32_t)0X00000006)
#define IOMUX_PINCM38_PF_TIMA0_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM38_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000008)
#define IOMUX_PINCM38_PF_I2C0_SCL                     ((uint32_t)0X00000009)
#define IOMUX_PINCM38_PF_TIMG8_CCP1                   ((uint32_t)0X0000000A)
#define IOMUX_PINCM38_PF_UART1_RX                     ((uint32_t)0X0000000B)
#define IOMUX_PINCM38_PF_SPI0_POCI                    ((uint32_t)0X0000000C)
#define IOMUX_PINCM38_PF_UART2_TX                     ((uint32_t)0X0000000D)

/* IOMUX_PINCM39[PF] Bits */
#define IOMUX_PINCM39_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM39_PF_GPIOB_DIO20                  ((uint32_t)0X00000001)
#define IOMUX_PINCM39_PF_SPI0_CS2_POCI2               ((uint32_t)0X00000002)
#define IOMUX_PINCM39_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM39_PF_TIMA_FAULT1                  ((uint32_t)0X00000006)
#define IOMUX_PINCM39_PF_TIMA0_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM39_PF_UART2_RTS                    ((uint32_t)0X00000008)
#define IOMUX_PINCM39_PF_I2C0_SDA                     ((uint32_t)0X00000009)
#define IOMUX_PINCM39_PF_UART1_CTS                    ((uint32_t)0X0000000C)
#define IOMUX_PINCM39_PF_TIMA0_CCP2_CMPL              ((uint32_t)0X0000000D)
#define IOMUX_PINCM39_PF_TIMG8_CCP1                   ((uint32_t)0X0000000E)

/* IOMUX_PINCM40[PF] Bits */
#define IOMUX_PINCM40_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM40_PF_GPIOB_DIO24                  ((uint32_t)0X00000001)
#define IOMUX_PINCM40_PF_SPI0_CS3_CD_POCI3            ((uint32_t)0X00000002)
#define IOMUX_PINCM40_PF_SPI0_CS1_POCI1               ((uint32_t)0X00000003)
#define IOMUX_PINCM40_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM40_PF_TIMA0_CCP1_CMPL              ((uint32_t)0X00000006)
#define IOMUX_PINCM40_PF_UART2_RTS                    ((uint32_t)0X00000008)
#define IOMUX_PINCM40_PF_SPI0_SCLK                    ((uint32_t)0X0000000C)
#define IOMUX_PINCM40_PF_TIMG14_CCP2                  ((uint32_t)0X0000000D)
#define IOMUX_PINCM40_PF_UART0_RTS                    ((uint32_t)0X0000000E)

/* IOMUX_PINCM41[PF] Bits */
#define IOMUX_PINCM41_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM41_PF_GPIOA_DIO23                  ((uint32_t)0X00000001)
#define IOMUX_PINCM41_PF_UART2_TX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM41_PF_SPI0_CS3_CD_POCI3            ((uint32_t)0X00000003)
#define IOMUX_PINCM41_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM41_PF_TIMG8_CCP0                   ((uint32_t)0X00000006)
#define IOMUX_PINCM41_PF_TIMG2_CCP0                   ((uint32_t)0X00000007)
#define IOMUX_PINCM41_PF_UART0_TX                     ((uint32_t)0X00000008)
#define IOMUX_PINCM41_PF_TIMG14_CCP0                  ((uint32_t)0X00000009)
#define IOMUX_PINCM41_PF_SPI0_POCI                    ((uint32_t)0X0000000C)
#define IOMUX_PINCM41_PF_UART0_CTS                    ((uint32_t)0X0000000D)

